app/controllers/api/v1/transactions/find_controller.rb

  def show
    render json: Transaction.find_by(find_params)
---
SELECT  "transactions".* FROM "transactions" WHERE "transactions"."updated_at" = $1 LIMIT $2  [["updated_at", "2017-01-01 00:00:00 UTC"], ["LIMIT", 1]]