app/controllers/api/v1/merchants/find_controller.rb

SELECT  "merchants".* FROM "merchants" WHERE "merchants"."updated_at" = $1 LIMIT $2  [["updated_at", "2017-01-01 00:00:00 UTC"], ["LIMIT", 1]]
---
  def show
    render json: Merchant.find_by(strong_params)