app/controllers/api/v1/items_controller.rb

      def index
        render json: Item.all
---
SELECT "items".* FROM "items"

      def show
        render json: Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]